ASKING_NAME = ('Введіть ваше імя та прізвище\n'
               'Нариклад: Боярчук Роман')
ASKING_CITY = 'У якому місті ви будете замовляти таксі? 🌆'
ASKING_REGION = 'Введіть вашу область 🏙'
ASKING_SUCCESSFUL_REG = 'Ви успішно авторизувались ✅'
ASKING_MENU = 'Головне меню'

ASKING_SEARCH_DRIVER = 'Ведемо пошук водіїв🔍'
ASKING_NOT_SEARCH_DRIVER = 'На жаль за Вашим запитом немає вільних водіїв. 😢'
ASKING_NOT_ACTIVE_DRIVER = 'Наразі немає активних водіїв у вашому місті 😢'
ASKING_WAIT_ACCEPT_ORDER = 'Водія знайдено. Чекаємо підтвердження замовлення від водія...'
ASKING_NOT_ACCEPT_DRIVER = ('На жаль водії не беруть Ваше замовлення, '
                            'змініть, будь ласка, клас таксі або підвищіть вартість поїздки. 😢')
ASKING_WAIT_PRICE = 'Введіть нову ціну (нова ціна не може бути нижчою за попередню) 💸'

ASKING_TAKE_SUCCESSFUL = 'Замовлення прийнято ✅'

ASKING_SHARE_GEO = 'Для початку роботи, будь ласка, увімкніть функцію маячок у Telegram 📍'
ASKING_INCORRECT_GEO_PROVISION = 'Для початку роботи вам необхідно надати маячок ❗️'
ASKING_INCORRECT_TIME_GEO = 'Будь ласка, поділіться маячком, який буде постійно увімкнений ❗️'
GOT_ON_LINE = 'Ви успішно вийшли на лінію ✅'

ASKING_EDIT_NAME = 'Імя успішно змінено ✅'
ASKING_EDIT_CITY = 'Місто успішно змінено ✅'
ASKING_EDIT_REGION = 'Область успішно змінена ✅'



