NAME = (
    'Введите ваше имя и фамилию\n'
    'Например: Боярчук Роман'
)
CITY = 'В каком городе вы будете заказывать такси? 🌆'
REGION = 'Введите вашу область 🏙'
SUCCESSFUL_REG = 'Вы успешно авторизовались ✅'
MENU = 'Главное меню'
PHONE = (
    "Для заказа такси мне необходимо знать ваш номер телефона. Чтобы отправить номер телефона, нажмите кнопку "
    "ниже."
)

SEARCH_DRIVER = 'Ищем водителей 🔍'
NOT_SEARCH_DRIVER = 'К сожалению, по вашему запросу нет свободных водителей. 😢'
NOT_ACTIVE_DRIVER = 'В данный момент нет активных водителей в вашем городе 😢'
WAIT_ACCEPT_ORDER = 'Водитель найден. Ожидаем подтверждения заказа от водителя...'
NOT_ACCEPT_DRIVER = (
    'К сожалению, водители не принимают ваш заказ, '
    'пожалуйста, измените класс такси или увеличьте стоимость поездки. 😢'
)
WAIT_COST = 'Введите новую цену (новая цена не может быть ниже предыдущей) 💸'

TAKE_SUCCESSFUL = 'Заказ принят ✅'

SHARE_GEO = 'Для начала работы, пожалуйста, включите функцию маячок в Telegram 📍'
INCORRECT_GEO_PROVISION = 'Для начала работы необходимо предоставить маячок ❗️'
INCORRECT_TIME_GEO = 'Пожалуйста, поделитесь маячком, который будет оставаться активным ❗️'
GOT_ON_LINE = 'Вы успешно вышли на линию ✅'

EDIT_NAME = 'Имя успешно изменено ✅'
EDIT_CITY = 'Город успешно изменен ✅'
EDIT_REGION = 'Область успешно изменен ✅'

GOT_OFF_LINE = 'Вы сошли с линии'
ORDER_HISTORY_INFO = 'Здесь вы можете просмотреть историю ваших поездок и их детали'
ORDER_HISTORY_EMPTY = "История поездок пуста"
CHOOSE_ORDER = 'Выберите ваш заказ из списка 👇'
WAITING_ORDER = 'Ожидайте заказ или посмотрите, какие заказы есть в вашем городе 🌇'
DRIVER_ARRIVED = 'Водитель уже прибыл 🎉'
EXTRA_WAITING_COST = 'Если ожидание превысит 3 минуты, каждая следующая минута будет стоить 3 грн ❗️'
PASSENGER_NOTIFIED = 'Мы сообщили пассажиру, что вы прибыли 📣'
CONFIRM_CANCEL_ORDER = 'Вы уверены, что хотите отменить заказ?'
CANCELLED_BY_DRIVER = 'Водитель отменил заказ 🚫'
ORDER_CANCELLED = 'Заказ отменен 🚫'
EXTRA_COST_APPLIED = 'Цена увеличена на {extra_cost} за долгое ожидание ❗️'
TRIP_STARTED = 'Поездка начата 🚕'
TRIP_ENDED = 'Поездка завершена ✅'
RATE_TRIP = 'Как прошла поездка?'
RATE_PASSENGER = '⭐️ Оцените поездку с пассажиром ⭐️'
ORDER_MENU = 'Меню заказа'
NAVIGATION_METHOD_CHOICE = 'Выберите метод прокладки маршрута 👇'

ENTER_WORK_REGION = 'Введите область, в котором вы будете работать 🌇'
ENTER_WORK_CITY = 'Введите город, в котором вы будете работать 🌇'
ENTER_CAR_MODEL = 'Введите марку и модель авто 🚗'
ENTER_CAR_NUMBER = 'Введите номер вашего авто 🆔'
ENTER_SEAT_COUNT = 'Введите количество сидений 💺'
ENTER_CAR_COLOR = 'Введите цвет авто 🟨'
SEND_DRIVER_LICENSE_PHOTO = 'Отправьте фото водительского удостоверения 🪪'
DRIVER_LICENSE_DETAILS = 'Водительское удостоверение с открытой категорией "В" - стороной, где указаны ваши фото, имя и фамилия, номер документа и дата рождения.'
SEND_CAR_FRONT_PASSPORT_PHOTO = 'Отправьте фото передней стороны техпаспорта 🪪'
SEND_CAR_BACK_PASSPORT_PHOTO = 'Отправьте фото заднюю сторону техпаспорта 🪪'
CAR_PASSPORT_DETAILS = 'Стороной, где указан государственный номер авто и год его выпуска.'
SEND_INSURANCE_PHOTO = 'Отправьте фото страховки 🪪'
SEND_CAR_PHOTO = 'Отправьте фото авто 🚗'
SEND_FRONT_CAR_PHOTO = 'Отправьте фото авто впереди 🚗'
SEND_BACK_CAR_PHOTO = 'Отправьте фото авто сзада 🚗'
SEND_LEFT_CAR_PHOTO = 'Отправьте фото авто слева 🚗'
SEND_RIGHT_CAR_PHOTO = 'Отправьте фото авто справа 🚗'

SEND_FRONT_ROW_CAR_PHOTO = 'Отправьте фото передний ряд сидений 💺'
SEND_BACK_ROW_CAR_PHOTO = 'Отправьте фото задних ряд сидений 💺'

SUBMISSION_SUCCESS = 'Заявка отправлена, ожидайте её подтверждения ✅'
REQUEST_DRIVER_CONFIRMATION = 'Вы хотите заказать такси в {city}?'
SHARE_LINK = 'Вот ссылка для ваших друзей 😊\n{BOT_URL}'
CITY_ACCEPTED = 'Город принят ✅'
START_TAXI_ORDER = 'Для начала оформления такси нажмите кнопку ниже. 👇'
ORDER_DATA_RECEIVED = 'Данные получены, заказ формируется...'
PROCEED_TO_PAYMENT = 'Нажмите кнопку ниже для оплаты 👇'
THANK_YOU = 'Спасибо!'
COST_CHANGE_WARNING = 'Новая цена не может быть ниже предыдущей ❗️'
COST_UPDATED = 'Цена изменена ✅'
SEND_MESSAGE_TO_DRIVER = 'Отправьте мне сообщение, и я перешлю его водителю.'
SEND_MESSAGE_TO_PASSENGER = 'Отправьте мне сообщение, и я перешлю его пассажиру.'
ORDER_PARTIAL_REFUND = 'Средства с заказа будут частично возвращены ({refund_amount} грн.)❗️'
ORDER_CANCEL_CONFIRMATION = 'Вы уверены, что хотите отменить заказ?'
ORDER_CANCELLED_BY_PASSENGER = 'Пассажир отменил заказ 🚫'
COMPENSATION_GRANTED = 'Вам предоставлена компенсация в размере {compensation_amount} грн.'
BECOME_PARTNER = 'Вы можете стать партнером. Для этого заполните заявку'
SEND_FULL_NAME = 'Введите вашу фамилию, имя и отчество\nНапример: Боярчук Роман Олександрович'
SEND_MESSAGE_TO_DRIVER_FINAL = 'Отправьте мне сообщение, и я перешлю его водителю.'

MESSAGE_FROM_PASSENGER = 'Сообщение от пассажира 💬'
MESSAGE_FROM_DRIVER = 'Сообщение от водителя💬'
MESSAGE_SEND = 'Сообщение отправлено ✅'
OTHER_INFO = 'Здесь вы можете отправить заявление на водителя и прочее...'

CITY_NOT_FOUND = 'Город не найден в вашей области 🛑'
REGION_NOT_FOUND = 'Область не найдена 🛑'

CHOOSE_LANGUAGE = "Выберите язык 🌏"
TRY_AGAIN = 'Попробуйте снова'
SEND_COMMENT = 'Отправьте комментарий 💬'

ACCEPT_DRIVER_APPLICATION = 'Ваша заявка на становление водителя рассмотрена и согласована ✅'


