SHARE_CONTACT = "Поделиться номером телефона"

EDIT_NAME = "Изменить имя"
EDIT_CITY = "Изменить город"
EDIT_REGION = "Изменить область"
EDIT_LANGUAGE = 'Изменить язык'
OPEN_MENU = "Главное меню 🔙"
TO_MENU = "В меню 🔙"
BACK = "Назад 🔙"

BECOME_PARTNER = 'Стать партнером 🚖'
REPORT_ISSUE = 'Сообщить о проблеме 🗣'
ALL_TRUE = 'Все верно ✅'

SEARCH_AGAIN = "Искать еще раз 🔎"
CHANGE_PRICE = 'Повысить стоимость поездки 💸'
ORDER_INFO = 'Информация о заказе ℹ️'
CANCEL_ORDER = 'Отменить заказ 🚫'
CHAT_WITH_DRIVER = "Чат с водителем 💬"
CHAT_WITH_PASSENGER = "Чат с пассажиром 💬"
REPLY_THE_MESSAGE = "Ответить на сообщение ↩️"
SOS = 'SOS 🆘'
OPEN_NAVIGATOR = 'Построить маршрут'

NAVIGATION_BY_GOOGLE = 'Открыть стандартный навигатор'
NAVIGATION_BY_WAZE = 'Открыть через приложение WAZE'

DRIVER_ON_PLACE = "Я на месте ❇️"
DRIVER_START_ORDER = 'Начать поездку ✅'
DRIVER_END_ORDER = 'Завершить поездку ❎'
ADDITIONAL_POINT = 'Я прибыл в промежуточную точку ⏱'
OFF_TIMER = 'Остановить таймер, двигаемся дальше ⏱'

YES = "Да ✅"
NO = "Нет 🚫"

# Текст меню водителя
LIST_ORDER = 'Список заказов 🚕'
INFO = "Моя информация 👤"
HISTORY_ORDER = 'История поездок 🕔'
SETTING = "Настройки ⚙️"
OTHER = "Другое 🧩"
DEACTIVATE_DRIVER = "Сойти с линии 🪫"
ACTIVATE_DRIVER = "Выйти на линию 🚖"

OPEN_HISTORY_ORDER = "Открыть историю заказов 📋"

OPEN_STANDARD_METHOD_NAVIGATION = "Открыть стандартный метод"
OPEN_WAZE_METHOD_NAVIGATION = "Открыть через приложение Waze"

ORDER_TAXI = 'Заказать такси 🚕'

ACCEPT = 'Принять ✅'
SKIP = 'Пропустить 🚫'

PAY = 'Оплатить 💳'

SHARE_CHATBOT = 'Поделиться чат-ботом 🤝️'
SHARE = 'Поделиться'

PRE_ORDER = 'Повторить последнюю поездку 🕤'
TOP_UP = 'Пополнить баланс 💰'
MONEY_TRANSFERRED = 'Средства перечислены ✅'

RELOAD = 'Перезагрузить бота 🔄'
PLANNED_ORDER = 'Предварительный заказ 📅'
STANDARD_ORDER = 'Заказ на сейчас'
PLANNED_ORDER_LIST = 'Запланированные поездки 📅'
PLANED_ORDER_START = "Начать поездку ✅"

TRACKING_DRIVER = 'Местонахождение водителя 📍'

REPLACE_COST = 'Пересчет тарифа 💱'