NAME = (
    'Введіть ваше ім\'я та прізвище\n'
    'Наприклад: Боярчук Роман'
)
CITY = 'У якому місті ви будете замовляти таксі? 🌆'
REGION = 'Введіть вашу область 🏙'
SUCCESSFUL_REG = 'Ви успішно авторизувались ✅'
MENU = 'Головне меню'
PHONE = (
    "Для замовлення таксі мені необхідно знати ваш номер телефону. Щоб надіслати номер телефону, натисніть кнопку "
    "нижче."
)

SEARCH_DRIVER = 'Ведемо пошук водіїв🔍'
NOT_SEARCH_DRIVER = 'На жаль, за Вашим запитом немає вільних водіїв. 😢'
NOT_ACTIVE_DRIVER = 'Наразі немає активних водіїв у вашому місті 😢'
WAIT_ACCEPT_ORDER = 'Водія знайдено. Чекаємо підтвердження замовлення від водія...'
NOT_ACCEPT_DRIVER = 'На жаль, водії не приймають ваше замовлення, рекомендуємо збільшити вартість поїздки. 😢'
WAIT_COST = 'Введіть нову ціну (нова ціна не може бути нижчою за попередню) 💸'
WAIT_REPLACE_COST = 'Введіть ціну яку ви вважаєте коректною 💲'
WAIT_ACCEPT_PASSENGER_REPLACE_COST = 'Очікуємо підтвердження від пасажира'
WAIT_ACCEPT_DRIVER_REPLACE_COST = 'Очікуємо підтвердження від водія'
NO_ACCEPT_REPLACE_COST = 'Перерахунок тарифу було відхилено 🚫'
ACCEPT_REPLACE_COST = 'Тариф перераховано ✅'

TAKE_SUCCESSFUL = 'Замовлення прийнято ✅'

SHARE_GEO = 'Для початку роботи, будь ласка, увімкніть функцію маячок у Telegram 📍'
INCORRECT_GEO_PROVISION = 'Для початку роботи вам необхідно надати маячок ❗️'
INCORRECT_TIME_GEO = 'Будь ласка, поділіться маячком, який буде постійно увімкнений ❗️'
GOT_ON_LINE = 'Ви успішно вийшли на лінію ✅'

EDIT_NAME = 'Ім\'я успішно змінено ✅'
EDIT_CITY = 'Місто успішно змінено ✅'
EDIT_REGION = 'Область успішно змінена ✅'

GOT_OFF_LINE = 'Ви зійшли з лінії'
ORDER_HISTORY_INFO = 'Тут ви зможете переглянути історію ваших поїздок та їх деталі'
ORDER_HISTORY_EMPTY = "Історія поїздок порожня"
CHOOSE_ORDER = 'Оберіть зі списку ваше замовлення 👇'
WAITING_ORDER = 'Чекайте замовлення або можете переглянути, які є замовлення у вашому місті 🌇'
DRIVER_ARRIVED = 'Водій уже прибув 🎉'
EXTRA_WAITING_COST = 'Якщо очікування перевищить 3 хв, тоді кожна наступна хв. буде коштувати {price_wait} грн.️'
PASSENGER_NOTIFIED = 'Ми повідомили пасажира, що ви прибули 📣'
CONFIRM_CANCEL_ORDER = 'Ви впевнені, що бажаєте скасувати замовлення?'
CANCELLED_BY_DRIVER = 'Водій скасував замовлення 🚫'
ORDER_CANCELLED = 'Замовлення скасовано 🚫'
EXTRA_COST_APPLIED = 'Ціну збільшено на {extra_cost} за довге очікування ❗️'
TRIP_STARTED = 'Поїздку розпочато 🚕'
TRIP_ENDED = 'Поїздку завершено ✅'
RATE_TRIP = 'Як пройшла поїздка?'
RATE_PASSENGER = '⭐️ Оцініть поїздку з пасажиром ⭐️'
ORDER_MENU = 'Меню замовлення'
NAVIGATION_METHOD_CHOICE = 'Виберіть метод прокладання маршруту 👇'

ENTER_WORK_REGION = 'Введіть область, у якій ви будете працювати 🌇'
ENTER_WORK_CITY = 'Введіть місто, у якому ви будете працювати 🌇'
ENTER_CAR_MODEL = 'Введіть марку та модель авто 🚗'
ENTER_CAR_NUMBER = 'Введіть номер вашого авто 🆔'
ENTER_SEAT_COUNT = 'Введіть кількість сидінь 💺'
ENTER_CAR_COLOR = 'Введіть колір авто 🟨'
SEND_DRIVER_LICENSE_PHOTO = 'Надішліть фото водійського посвідчення 🪪'
DRIVER_LICENSE_DETAILS = 'Водійське посвідчення із відкритою категорією "В" – стороною, де вказані Ваші фото, ім’я та прізвище, номер документа та дата народження.'
SEND_CAR_FRONT_PASSPORT_PHOTO = 'Надішліть фото передньої сторони техпаспорта 🪪'
SEND_CAR_BACK_PASSPORT_PHOTO = 'Надішліть фото задньої сторони техпаспорта 🪪'
CAR_PASSPORT_DETAILS = 'Стороною, де вказаний державний номер авто та рік його випуску.'
SEND_INSURANCE_PHOTO = 'Надішліть фото страховки 🪪'
SEND_CAR_PHOTO = 'Надішліть фото авто 🚗'
SEND_FRONT_CAR_PHOTO = 'Надішліть фото авто спереду 🚗'
SEND_BACK_CAR_PHOTO = 'Надішліть фото авто ззаду 🚗'
SEND_LEFT_CAR_PHOTO = 'Надішліть фото авто зліва 🚗'
SEND_RIGHT_CAR_PHOTO = 'Надішліть фото авто справа 🚗'

SEND_FRONT_ROW_CAR_PHOTO = 'Надішліть фото передніх рядів сидінь 💺'
SEND_BACK_ROW_CAR_PHOTO = 'Надішліть фото задніх рядів сидінь 💺'

SUBMISSION_SUCCESS = 'Заявку відправлено, очікуйте її підтвердження ✅'
REQUEST_DRIVER_CONFIRMATION = 'Місто для замовлення - {city}?'
SHARE_LINK = 'Натисни кнопку нижче, щоб поділитись чат ботом'
CITY_ACCEPTED = 'Місто прийнято ✅'
START_TAXI_ORDER = 'Для початку оформлення таксі натисніть кнопку нижче. 👇'
ORDER_DATA_RECEIVED = 'Дані отримано, замовлення формується...'
PROCEED_TO_PAYMENT = 'Натисніть кнопку нижче для оплати 👇'
THANK_YOU = 'Дякуємо!'
COST_CHANGE_WARNING = 'Нова ціна не може бути нижчою за попередню ❗️'
COST_UPDATED = 'Ціну змінено ✅'
SEND_MESSAGE_TO_DRIVER = 'Надішліть мені повідомлення, і я його перешлю водію.'
SEND_MESSAGE_TO_PASSENGER = 'Надішліть мені повідомлення, і я його перешлю пасажиру.'
ORDER_PARTIAL_REFUND = 'Кошти з замовлення будуть повернені частково ({refund_amount} грн.)❗️'
ORDER_CANCEL_CONFIRMATION = 'Ви впевнені, що бажаєте скасувати замовлення?'
ORDER_CANCELLED_BY_PASSENGER = 'Пасажир скасував замовлення 🚫'
COMPENSATION_GRANTED = 'Вам надано компенсацію в розмірі {compensation_amount} грн.'
BECOME_PARTNER = 'Ви можете стати партнером. Для цього заповніть заявку'
SEND_FULL_NAME = 'Введіть прізвище, ім’я та по батькові\nНаприклад: Боярчук Роман Олександрович'

MESSAGE_FROM_PASSENGER = 'Повідомлення від пасажира 💬'
MESSAGE_FROM_DRIVER = 'Повідомлення від водія💬'
MESSAGE_SEND = 'Повідомлення відправлено ✅'
OTHER_INFO = 'Тут ви зможете відправити заяву на водія та інше...'

CITY_NOT_FOUND = 'Місто не найдено в вашій області 🛑'
REGION_NOT_FOUND = 'Область не найдена 🛑'

CHOOSE_LANGUAGE = "Виберіть мову 🌏"
TRY_AGAIN = 'Спробуйте ще раз'
SEND_COMMENT = 'Надішліть коментар 💬'

ACCEPT_DRIVER_APPLICATION = 'Вашу заявку на становлення водієм розглянуто та погоджено ✅'
ON_TIMER = 'Таймер на очікування включено'

TOP_UP_BALANCE = 'Для продовження роботи необхідно поповнити баланс.\nЗайдіть в налаштування -> поповнити баланс'
TOP_UP_SUCCESSFUL = 'Баланс поповнено ✅'
FOR_TOP_UP_BALANCE = 'Для поповнення балансу перекажіть кошти за реквізитами, потім натисніть кнопку нижче\n<b>4149499128195434</b>'

CANCEL_DRIVER_APPLICATION = 'У заявці на водія було відмолено 🚫'
TO_UP_END = "Дякуємо, кошти будуть зараховані на баланс протягом 24 год"
CARD_TRANSFER = 'Введіть карту з якої був здійснений переказ'
AMOUNT_TRANSFER = 'Введіть суму переказу'

SOS_COMMENT = 'Опишіть ситуацію яка у вас відбулася 💬'
SOS_SEND = 'Ми надіслали повідомлення водіям, які знаходяться поруч з вами ✅'

DUPLICATE_SETTLEMENT = 'Ми найшли декілька нас. пунктів з такою назвою, будь ласка введіть біля вашого нас. пункту район\nНаприклад: Владиславка Обухівський район'
PRE_ORDER_NOT_FOUND = 'Вибачте, але у вас немає замовлень'

CANCEL_FAIL = 'Вибачте замовлення не можливо скасувати водій уже в дорозі'
ACCEPT_ORDER_FAIL = 'Замовлення вже взято іншим водієм 😢'

ALERT_CANCEL_ORDER = ('Зверніть увагу,'
                      'при частому скасуванні замовлення буде застосовано штраф у розмірі 50 грн. '
                      'У випадку третього скасування обліковий запис буде заблоковано. ⚠️')

DATE_PLANNED_ORDER = 'Вкажіть на яку дату ви плануєте поїздку?\nНаприклад: 27.09.2024'
TIME_PLANNED_ORDER = 'О котрій годині ви плануєте поїздку?\nНаприклад: 17:24'
PLANNED_ORDER_SUCCESSFUL = 'Поїздку заплановано ✅'
ALL_PLANNED_ORDERS = 'Список всіх активних запланованих поїздок'
NOTHING_PLANNED_ORDER = 'У вас немає запланованих поїздок'
PLANNED_ORDER_START = 'Запланована поїздка розпочата ✅'

FAIL_GEO_DRIVER = 'Нам не вдалося отримати ваше поточне місцезнаходження. Будь ласка, відійдіть з лінії та поверніться, щоб оновити дані.'
LIVE_LOCATION_DRIVER = 'Ви можете переглянути місцезнаходження водія, натиснувши на кнопку зверху 🔝'

RAW_MASSAGE = """
Здається, ви надіслали щось не в тому місці. Будь ласка, перевірте ще раз і відправте у відповідний розділ. Дякую!
Якщо ви застрягли на якомусь етапі, введіть команду /start для перезапуску бота.
"""

